In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
df = DataFrame({'key1': ['a', 'a', 'b', 'b', 'a'],
                'key2': ['one', 'two', 'one', 'two', 'one'],
                'data1': np.random.randn(5),
                'data2': np.random.randn(5)})
df

      data1     data2 key1 key2
0 -0.435152 -0.820388    a  one
1  0.760599 -0.613546    a  two
2 -1.353682 -1.179562    b  one
3 -0.319408 -0.518150    b  two
4  0.292729 -0.051525    a  one

In [3]:
grouped=df['data1'].groupby(df['key1'])
grouped

In [4]:
grouped.mean()

key1
a    0.206059
b   -0.836545
Name: data1, dtype: float64

In [5]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one    -0.071211
      two     0.760599
b     one    -1.353682
      two    -0.319408
Name: data1, dtype: float64

In [6]:
means.unstack()

key2       one       two
key1
a    -0.071211  0.760599
b    -1.353682 -0.319408

In [7]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005    0.760599
            2006   -1.353682
Ohio        2005   -0.377280
            2006    0.292729
Name: data1, dtype: float64

In [8]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.206059 -0.495153
b    -0.836545 -0.848856

In [9]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.071211 -0.435957
     two   0.760599 -0.613546
b    one  -1.353682 -1.179562
     two  -0.319408 -0.518150

In [10]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [11]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0 -0.435152 -0.820388    a  one
1  0.760599 -0.613546    a  two
4  0.292729 -0.051525    a  one
b
      data1     data2 key1 key2
2 -1.353682 -1.179562    b  one
3 -0.319408 -0.518150    b  two

In [12]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print(k1, k2)
    print(group)

a one
      data1     data2 key1 key2
0 -0.435152 -0.820388    a  one
4  0.292729 -0.051525    a  one
a two
      data1     data2 key1 key2
1  0.760599 -0.613546    a  two
b one
      data1     data2 key1 key2
2 -1.353682 -1.179562    b  one
b two
      data1    data2 key1 key2
3 -0.319408 -0.51815    b  two

In [13]:
pieces = dict(list(df.groupby('key1')))
pieces['b']

      data1     data2 key1 key2
2 -1.353682 -1.179562    b  one
3 -0.319408 -0.518150    b  two

In [14]:
people = DataFrame(np.random.randn(5, 5),
                   columns=['a', 'b', 'c', 'd', 'e'],
                   index=['Joe', 'Steve', 'Wes', 'Jim', 'Traivs'])
people.loc[2:3, ['b', 'c']] = np.nan

In [15]:
people

               a         b         c         d         e
Joe    -0.809353 -0.233967 -0.207742  1.159816 -0.152107
Steve   0.636564  0.377236  1.166902  0.075121 -0.199816
Wes     0.429219       NaN       NaN  0.988507  0.557524
Jim    -0.810071  0.595008  0.266639  1.293011 -0.668113
Traivs -2.256045  1.049055  0.257288 -1.566239 -1.192631

In [16]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f': 'orange'}
by_column = people.groupby(mapping, axis=1)
by_column.sum()

            blue       red
Joe     0.952075 -1.195427
Steve   1.242022  0.813985
Wes     0.988507  0.986743
Jim     1.559650 -0.883176
Traivs -1.308951 -2.399621

In [17]:
map_series = Series(mapping)
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Traivs     2    3

In [18]:
people.groupby(len).sum()

          a         b         c         d         e
3 -1.190205  0.361041  0.058897  3.441334 -0.262697
5  0.636564  0.377236  1.166902  0.075121 -0.199816
6 -2.256045  1.049055  0.257288 -1.566239 -1.192631

In [19]:
df

      data1     data2 key1 key2
0 -0.435152 -0.820388    a  one
1  0.760599 -0.613546    a  two
2 -1.353682 -1.179562    b  one
3 -0.319408 -0.518150    b  two
4  0.292729 -0.051525    a  one

In [20]:
grouped = df.groupby('key1')
grouped

In [21]:
grouped['data1'].quantile(0.9)

key1
a    0.667025
b   -0.422836
Name: data1, dtype: float64

In [23]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.195751  0.768863
b     1.034273  0.661412

In [24]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.206059  0.602568 -0.435152 -0.071211  0.292729  0.526664
b      2.0 -0.836545  0.731342 -1.353682 -1.095113 -0.836545 -0.577977

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.760599   3.0 -0.495153  0.397869 -0.820388 -0.716967 -0.613546
b    -0.319408   2.0 -0.848856  0.467689 -1.179562 -1.014209 -0.848856


           75%       max
key1
a    -0.332535 -0.051525
b    -0.683503 -0.518150

In [25]:
tips = pd.read_csv('tips.csv')

In [28]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [31]:
grouped = tips.groupby(['sex', 'smoker'])
grouped_pct = grouped['tip_pct']
grouped_pct.agg('mean')

sex     smoker
Female  No        0.156921
        Yes       0.182150
Male    No        0.160669
        Yes       0.152771
Name: tip_pct, dtype: float64

In [33]:
grouped_pct.agg(['mean','std', peak_to_peak])

                   mean       std  peak_to_peak
sex    smoker
Female No      0.156921  0.036421      0.195876
       Yes     0.182150  0.071595      0.360233
Male   No      0.160669  0.041849      0.220186
       Yes     0.152771  0.090588      0.674707

In [34]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                    foo       bar
sex    smoker
Female No      0.156921  0.036421
       Yes     0.182150  0.071595
Male   No      0.160669  0.041849
       Yes     0.152771  0.090588

In [36]:
functions = ['count', 'mean', 'max']
result = grouped['tip_pct', 'total_bill'].agg(functions)
result

              tip_pct                     total_bill
                count      mean       max      count       mean    max
sex    smoker
Female No          54  0.156921  0.252672         54  18.105185  35.83
       Yes         33  0.182150  0.416667         33  17.977879  44.30
Male   No          97  0.160669  0.291990         97  19.791237  48.33
       Yes         60  0.152771  0.710345         60  22.284500  50.81

In [38]:
grouped.agg({'tip': 'max', 'size': 'sum'})

               size   tip
sex    smoker
Female No       140   5.2
       Yes       74   6.5
Male   No       263   9.0
       Yes      150  10.0

In [39]:
grouped.agg({'tip_pct': ['min', 'max', 'mean', 'std'], 'size': 'sum'})

              size   tip_pct
               sum       min       max      mean       std
sex    smoker
Female No      140  0.056797  0.252672  0.156921  0.036421
       Yes      74  0.056433  0.416667  0.182150  0.071595
Male   No      263  0.071804  0.291990  0.160669  0.041849
       Yes     150  0.035638  0.710345  0.152771  0.090588